Tekla Open API Reference for Tekla Structures 2025
LoadGroup.GroupType Property
 The load group type.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public LoadGroup.LoadGroupType GroupType { get; set; }
Public Property GroupType As LoadGroup.LoadGroupType
	Get
	Set
Property Value
Type: LoadGroup.LoadGroupType
See Also
Reference
LoadGroup Class
Tekla.Structures.Model Namespace